# brewfile
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'wez/wezterm'
tap 'shaunsingh/SFMono-Nerd-Font-Ligaturized'

# GNU
brew 'coreutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-indent'
brew 'gnu-which'
brew 'stow'
brew 'groff'

# finding
brew 'ripgrep'
brew 'fzf'
brew 'fd'

# parsing
brew 'jq'
brew 'bat'
brew 'exa'
brew 'tree'
brew 'pandoc'
brew 'rename'

# dev
brew 'curl'
brew 'wget'
brew 'git'
brew 'lazygit'
brew 'gh'
brew 'diff-so-fancy'
brew 'tree-sitter'
brew 'sqlite'
brew 'neofetch'
brew 'neovim'
brew 'mas'
brew 'tldr'

# multimedia
brew 'silicon' # code screenshots
brew 'ffmpeg'
brew 'mpv'
brew 'yt-dlp'
brew 'streamlink'

brew 'openttd'
brew 'fheroes2'


# casks
cask 'amethyst'
cask 'adguard'
cask 'discord'
cask 'basictex'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'handbrake'
cask 'hiddenbar'
cask 'iina'
cask 'iterm2'
cask 'keka'
cask 'ngrok'
cask 'postman'
cask 'sequel-ace'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'telegram'
cask 'transmission'
cask 'visual-studio-code'
cask 'wez/wezterm/wezterm'
cask 'finicky'
cask 'suspicious-package'
cask 'vlc'
cask 'keepingyouawake'
cask 'orion'
cask 'karabiner-elements'

# Quicklook
cask 'qlstephen'
cask 'suspicious-package'

# fonts
cask 'font-jetbrains-mono-nerd-font'
cask 'font-sf-mono-nerd-font-ligaturized'
cask 'font-roboto'
cask 'font-source-sans-pro'
cask 'font-inter'
cask 'font-fira-code'
