# brewfile
tap 'homebrew/bundle'
tap 'shaunsingh/SFMono-Nerd-Font-Ligaturized'

# password requireres
cask 'karabiner-elements'
cask 'adguard'
cask 'nikitabobko/tap/aerospace'

# GNU
brew 'coreutils'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'groff'
brew 'stow'
brew 'urlview'

# finding
brew 'fd'
brew 'fzf'
brew 'ripgrep'

# parsing
brew 'bat'
brew 'eza'
brew 'jq'
brew 'pandoc'
brew 'rename'
brew 'sd'
brew 'tectonic'
brew 'tree'

# dev
brew 'btop'
brew 'colima'
brew 'diff-so-fancy'
brew 'gh'
brew 'git'
brew 'go'
brew 'gping'
brew 'hyperfine'
brew 'lazydocker'
brew 'lazygit'
brew 'opam'
brew 'podman'
brew 'qemu'
brew 'rsync'
brew 'sqlite'
brew 'starship'
brew 'tldr'
brew 'tree-sitter'
brew 'wget'
brew 'zoxide'
cask 'ghostty'
cask 'wez/wezterm/wezterm'

# multimedia
brew 'ffmpeg'
brew 'ghostscript'
brew 'imagemagick'
brew 'innoextract'
brew 'mpv'
brew 'optipng'
brew 'resvg'
brew 'silicon' # code screenshots
brew 'streamlink'
brew 'yt-dlp'

# macos ui
brew 'FelixKratz/formulae/borders'

# macos file associations
brew 'duti'

# mail
brew 'abook'
brew 'neomutt'
brew 'notmuch'

brew 'pass'

brew 'fheroes2'
brew 'openttd'

# casks
cask 'balenaetcher'
cask 'discord'
cask 'finicky'
cask 'iina'
cask 'jordanbaird-ice'
cask 'keycastr'
cask 'mac-mouse-fix'
cask 'meetingbar'
cask 'slack'
cask 'spotify'
cask 'utm'
cask 'vlc'
cask 'zen-browser'

# fonts
cask 'font-fira-code'
cask 'font-inter'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-roboto'
cask 'font-sf-mono-nerd-font-ligaturized'
cask 'font-sf-mono-nerd-font-ligaturized'
cask 'font-source-sans-pro'
