# brewfile
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'shaunsingh/SFMono-Nerd-Font-Ligaturized'
tap 'wez/wezterm'

# GNU
brew 'coreutils'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'groff'
brew 'stow'

# finding
brew 'fd'
brew 'fzf'
brew 'ripgrep'

# parsing
brew 'bat'
brew 'eza'
brew 'jq'
brew 'pandoc'
brew 'rename'
brew 'sd'
brew 'tree'

# dev
brew 'btop'
brew 'colima'
brew 'diff-so-fancy'
brew 'docker-buildx'
brew 'docker-completion'
brew 'docker-compose'
brew 'gh'
brew 'git'
brew 'go'
brew 'lazygit'
brew 'mas'
brew 'neofetch'
brew 'neovim'
brew 'opam'
brew 'rsync'
brew 'sqlite'
brew 'starship'
brew 'tldr'
brew 'tree-sitter'
brew 'wget'
brew 'zoxide'

# multimedia
brew 'ffmpeg'
brew 'ghostscript'
brew 'imagemagick'
brew 'innoextract'
brew 'mpv'
brew 'optipng'
brew 'resvg'
brew 'silicon' # code screenshots
brew 'streamlink'
brew 'yt-dlp'

# macos ui
brew 'borders'

# mail
brew 'abook'
brew 'neomutt'
brew 'notmuch'

brew 'ks' # MacOS Keychain pass
brew 'pass' # pass

brew 'fheroes2'
brew 'openttd'


# casks
cask 'adguard'
cask 'aerospace'
cask 'balenaetcher'
cask 'basictex'
cask 'bettertouchtool'
cask 'bruno'
cask 'db-browser-for-sqlite'
cask 'discord'
cask 'finicky'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'gog-galaxy'
cask 'google-chrome'
cask 'handbrake'
cask 'iina'
cask 'iterm2'
cask 'jordanbaird-ice'
cask 'karabiner-elements'
cask 'keka'
cask 'keycastr'
cask 'mac-mouse-fix'
cask 'meetingbar'
cask 'qutebrowser'
cask 'responsively'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'telegram'
cask 'transmission'
cask 'vlc'
cask 'wez/wezterm/wezterm'

# fonts
cask 'font-fira-code'
cask 'font-inter'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-roboto'
cask 'font-sf-mono-nerd-font-ligaturized'
cask 'font-source-sans-pro'
